Transformed all my csv files into a mysql database. In order to document my sql queries with jupyter notebook I'll be using pandas on python.

Importing pandas and mysql.connector to connect to the database

In [1]:
import mysql.connector
import pandas as pd
import creds

In [2]:
db= mysql.connector.connect(
    host="localhost",
    user="root",
    passwd=creds.passwd,
    database="nfl salary analysis"
)

Using SQL I found the total salary of each position in the top 1000 players for every year.

In [3]:
df = pd.read_sql_query(("""
                       select 
    a.POS AS Position, 
    CONCAT('$',format(sum(a.salary),'N')) as '2013 Salary',
    CONCAT('$',format(b.salary1,'N')) as '2014 Salary',
    CONCAT('$',format(c.salary2,'N')) as '2015 Salary',
    CONCAT('$',format(d.salary3,'N')) as '2016 Salary',
    CONCAT('$',format(e.salary4,'N')) as '2017 Salary',
    CONCAT('$',format(f.salary5,'N')) as '2018 Salary',
    CONCAT('$',format(g.salary6,'N')) as '2019 Salary',
    CONCAT('$',format(h.salary7,'N')) as '2020 Salary',
    CONCAT('$',format(i.salary8,'N')) as '2021 Salary',
    CONCAT('$',format(j.salary9,'N')) as '2022 Salary',
    CONCAT('$',format((sum(a.salary) + b.salary1 + c.salary2 + d.salary3 + e.salary4 + f.salary5 + g.salary6 + h.salary7 +i.salary8 +j.salary9),'N')) As `Total Salary`
from nfl_2013_salary as a
INNER JOIN (SELECT 
            pos, 
            sum(salary) as salary1
            FROM nfl_2014_salary
            GROUP BY POS) AS b
on a.POS = b.POS
INNER JOIN(SELECT
            POS,
            SUM(salary) as salary2
            FROM nfl_2015_salary
            GROUP BY POS) AS C
on a.pos = c.pos
INNER JOIN(SELECT
            POS,
            SUM(salary) as salary3
            FROM nfl_2016_salary
            GROUP BY POS) AS D
on a.pos = D.pos
INNER JOIN(SELECT
            POS,
            SUM(salary) as salary4
            FROM nfl_2017_salary
            GROUP BY POS) AS E
on a.pos = E.pos
INNER JOIN(SELECT
            POS,
            SUM(salary) as salary5
            FROM nfl_2018_salary
            GROUP BY POS) AS F
on a.pos = F.pos
INNER JOIN(SELECT
            POS,
            SUM(salary) as salary6
            FROM nfl_2019_salary
            GROUP BY POS) AS G
on a.pos = G.pos
INNER JOIN(SELECT
            POS,
            SUM(salary) as salary7
            FROM nfl_2020_salary
            GROUP BY POS) AS H
on a.pos = H.pos
INNER JOIN(SELECT
            POS,
            SUM(salary) as salary8
            FROM nfl_2021_salary
            GROUP BY POS) AS I
on a.pos = I.pos
INNER JOIN(SELECT
            POS,
            SUM(salary) as salary9
            FROM nfl_2022_salary
            GROUP BY POS) AS J
on a.pos = J.pos
GROUP BY a.POS;



                        """)
                       
                       ,db)

c:\Users\jayso\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

Utilizing pandas .head() function to showcase that it works

In [4]:
df.head()

,Position,2013 Salary,2014 Salary,2015 Salary,2016 Salary,2017 Salary,2018 Salary,2019 Salary,2020 Salary,2021 Salary,2022 Salary,Total Salary
0,C,"$103,781,382","$117,026,581","$108,444,360","$124,327,440","$139,063,355","$193,933,183","$207,472,033","$209,151,206","$178,055,175","$188,199,658","$1,569,454,373"
1,CB,"$320,755,125","$362,089,920","$389,724,620","$459,391,725","$460,970,184","$493,619,272","$516,686,895","$605,209,792","$558,243,783","$632,834,360","$4,799,525,676"
2,DE,"$312,496,015","$334,881,648","$354,691,612","$367,940,425","$426,841,523","$439,211,072","$555,113,921","$579,334,701","$499,027,662","$520,099,227","$4,389,637,806"
3,DT,"$214,906,840","$234,842,797","$303,581,504","$320,317,810","$344,756,809","$380,640,461","$366,359,333","$471,865,295","$413,526,514","$465,652,197","$3,516,449,560"
4,FB,"$24,774,506","$23,448,124","$20,800,843","$15,142,654","$19,726,250","$16,455,000","$18,719,525","$24,426,033","$17,287,500","$28,782,500","$209,562,935"

To analyze the data even further I wanted to see how much each position's salaries have changed throughout the years

In [5]:
dfpc = pd.read_sql_query("""
        SELECT
        POSITION,
        CONCAT(((`2014 Salary`-`2013 Salary`)/`2013 Salary`)*100,'%') AS `2013-2014 %Change`,
        CONCAT(((`2015 Salary`-`2014 Salary`)/`2014 Salary`)*100,'%') AS `2014-2015 %Change`,
        CONCAT(((`2016 Salary`-`2015 Salary`)/`2015 Salary`)*100,'%') AS `2015-2016 %Change`,
        CONCAT(((`2017 Salary`-`2016 Salary`)/`2016 Salary`)*100,'%') AS `2016-2017 %Change`,
        CONCAT(((`2018 Salary`-`2017 Salary`)/`2017 Salary`)*100,'%') AS `2017-2018 %Change`,
        CONCAT(((`2019 Salary`-`2018 Salary`)/`2018 Salary`)*100,'%') AS `2018-2019 %Change`,
        CONCAT(((`2020 Salary`-`2019 Salary`)/`2019 Salary`)*100,'%') AS `2019-2020 %Change`,
        CONCAT(((`2021 Salary`-`2020 Salary`)/`2020 Salary`)*100,'%') AS `2020-2021 %Change`,
        CONCAT(((`2022 Salary`-`2021 Salary`)/`2021 Salary`)*100,'%') AS `2021-2022 %Change`,
        CONCAT(((`2022 Salary`-`2013 Salary`)/`2013 Salary`)*100,'%') AS `2013-2022 %Change`
        FROM Total_Salary_Each_Position_Per_Year;
        """,db)

c:\Users\jayso\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [6]:
dfpc.head()

,POSITION,2013-2014 %Change,2014-2015 %Change,2015-2016 %Change,2016-2017 %Change,2017-2018 %Change,2018-2019 %Change,2019-2020 %Change,2020-2021 %Change,2021-2022 %Change,2013-2022 %Change
0,C,12.7626%,-7.3336%,14.6463%,11.8525%,39.4567%,6.9812%,0.8093%,-14.8677%,5.6974%,81.3424%
1,CB,12.8867%,7.6320%,17.8760%,0.3436%,7.0827%,4.6732%,17.1328%,-7.7603%,13.3616%,97.2952%
2,DE,7.1635%,5.9155%,3.7353%,16.0083%,2.8979%,26.3889%,4.3632%,-13.8619%,4.2225%,66.4339%
3,DT,9.2766%,29.2701%,5.5130%,7.6296%,10.4084%,-3.7519%,28.7985%,-12.3634%,12.6052%,116.6763%
4,FB,-5.3538%,-11.2899%,-27.2017%,30.2694%,-16.5832%,13.7619%,30.4843%,-29.2251%,66.4931%,16.1779%

Interesting Findings: The Position that has grown the most within the 10 year span was the Free Safety position, growing 337%.
                    The Position that has declined the most was the Long snapper position, declining by -54%.